<h3>Q2<h3>

In [1]:
import pandas as pd
data = {'cities' : ['lahore','karachi',], 'provinces' : ['punjab','sindh']}

In [2]:
frame1 = pd.DataFrame(data)
print(frame1)

    cities provinces
0   lahore    punjab
1  karachi     sindh

In [3]:
data2 = {"cities": ["islamabad","karachi","peshawar","quetta"],
"provinces": ["capital","sindh", "KPK","Balochistan"]}

frame2 = pd.DataFrame(data2)

In [4]:
frame3 = pd.concat([frame1, frame2])
frame3

      cities    provinces
0     lahore       punjab
1    karachi        sindh
0  islamabad      capital
1    karachi        sindh
2   peshawar          KPK
3     quetta  Balochistan

In [5]:
frame3.drop_duplicates()

      cities    provinces
0     lahore       punjab
1    karachi        sindh
0  islamabad      capital
2   peshawar          KPK
3     quetta  Balochistan

In [6]:
frame3.sort_values("provinces")

      cities    provinces
3     quetta  Balochistan
2   peshawar          KPK
0  islamabad      capital
0     lahore       punjab
1    karachi        sindh
1    karachi        sindh

In [7]:
frame3.reset_index(drop=True)
print(frame3)

      cities    provinces
0     lahore       punjab
1    karachi        sindh
0  islamabad      capital
1    karachi        sindh
2   peshawar          KPK
3     quetta  Balochistan

<h3>Q3<h3>

In [8]:
t = {"Name" : ["", "Ali", "Ahmed", "Nida", ""], "Field" : ['C', 'E', 'E', 'C', 'C'], "Age" : ['','','','',''], "Marks" : [-90, 60, -10, 70, 75]}

In [9]:
table = pd.DataFrame(t)
table

    Name Field Age  Marks
0            C        -90
1    Ali     E         60
2  Ahmed     E        -10
3   Nida     C         70
4            C         75

In [13]:
table = table.drop(columns = ("Age"))

In [14]:
table["Name"].replace({"": "___"}, inplace=True)

In [12]:
table

    Name Field Age  Marks
0    ___     C        -90
1    Ali     E         60
2  Ahmed     E        -10
3   Nida     C         70
4    ___     C         75

In [33]:
table["Field"].replace({"C": 0, "E": 1}, inplace=True)

In [34]:
table

    Name  Field Age  Marks
0    ___      0        -90
1    Ali      1         60
2  Ahmed      1        -10
3   Nida      0         70
4    ___      0         75

In [36]:
marksAverage = table["Marks"].mean()

In [50]:
for index, row in table.iterrows():
    if(table["Marks"][index] < 0):
        table["Marks"][index] = marksAverage

<ipython-input-50-844b7c581d61>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  table["Marks"][index] = marksAverage

In [51]:
table

    Name  Field Age  Marks
0    ___      0         21
1    Ali      1         60
2  Ahmed      1         21
3   Nida      0         70
4    ___      0         75